[
    "Wow, I am blown away by the animation in that video.  How on earth does one create all of that?  I mean from imagination to video..... now there's a good idea!",
    "I have a downward wifi down side in my desktop. Very much excited for it. I think I developed a new wifi system.",
    "terrible intro really",
    "this video said so much and nothing at the same time",
    "duck",
    "The funny part is that at 1:20 when they say it works with thousands of branches, the animation gets laggy, lmao.",
    "I don't know but I want to believe that they made this animation using code only. it's sick btw, actually what you would expect from a video claiming that you can build anything",
    "Phil Wang, the on-screen/voice over talent once showed up on the UK show Taskmaster in a yellow Kill Bill tracksuit... And you have to wonder if anyone in Microsoft PR ever saw that! 🤣\n\nStill, he did his job. I have implemented GitHub in multiple international companies. I know what GitHub is... I only watched this video because of Phil Wang. 🤣",
    "i'd love to know the filmmaking team behind this video, especially the sound designer/composers and the animators/directors",
    "Git-Hub + Indian tutorial dude at YT was best pakej  you can get",
    "what time is it ?",
    "Can we get the news onto GitHub so that folks can pursue and follow the multiple branching versions of their truth :)",
    "I legit got goosebumps , nice job",
    "Owned by Microsoft",
    "Amazing",
    "what the hell was this? I didn't get it. Give like 10 examples where people use it.  Like what is a computer? 1-You can write resume. 2-Watch movies, 3-print pages or photos . So give examples like that.  I know people share codes. but why it should be used with application? how can a secrete app code is published on \"others\" sever? GitHub will steal, sell or share is it secretly. Where is zero trust then? or may be GitHub is Daddy and we should trust Daddy?",
    "This guy is a Chinese-British comedian. I think his name is Woo or something. He's quite funny actually.",
    "Still can't create an empty folder dho\n\nBut still the best👌",
    "why this so inspirational",
    "shows a duck model and calls it sunak, seniour software engineer.",
    "Phil Wang was definitely one of the last people I'd say i would expect to run a github ad",
    "till this day, i still need a reference of the git commands",
    "I like this one, it's dope!",
    "GitLab FTW BICHHH",
    "awesome!",
    "GitHub was great, time to move on. Fuck you Microsoft. Thanks a lot.",
    "Why does this look like the ordinary folk studios animation style",
    "Kay, now tell us Wtf is GitHub ?",
    "take my money",
    "F*ck Co-pilot",
    "Who is GitHub? GitHub is Microsoft.",
    "It's motivating me to use github",
    "Seriously freaking Pixar Killing 😭😭😭 animations",
    "I personally much prefer GitLab",
    "When does the GitHub movie come out?",
    "there is war in Ukraine. Stop it!",
    "@1:15 \"...so when we're ready to merge, we merge. Instantly.\" 😂\nAnybody who's been a part of any CI/CD project knows this *rarely*. And if it does, it's because the build script left out a big portion of the build! 🤣",
    "build anything? Really? like a House?",
    "This is called the advertisement. Good job.",
    "What is GitHub? GitHub is using the code you wrote and paid them for to keep private, to feed to their AI code-writing assistant that you also need to pay for.",
    "It's tinder for developers",
    "I've watch it all, \nso...\nWhat is github?",
    "👍♥️",
    "<3",
    "aweeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeesome",
    "I wish Meta avatars looked at least this good",
    "It is so secure that only Chinese hackers can access it.",
    "Well that's 300 bhat I'm never getting back",
    "sooo... who is Github?",
    "this was well done!!! great animation and explanation!!",
    "but why though",
    "Can I get the source code of this video??",
    "Takes rubber-ducking to a whole new level!",
    "Did a GitHub ad really just make me cry?",
    ".",
    "Our Mission is Simple: Get More People on Bikes!\nThe bike spaces was founded in 2000 as one of Tampa County's very first Schwinn shops. It is rumored that our store in Tampa was home to some of the first mountain bikes in the country. Cycling has changed dramatically as the decades have rolled by, but The Bike Spaces has never wavered from our total dedication to the sport.\nToday, The Bike Spaces is a growing family of bike shops, all with a singular purpose - to get as many people on bikes as possible. We operate twelve wildly successful stores in Tampa and Paris! Our professional staff of over 20 cycling enthusiasts will ensure that your experiences both in the store and on your bike are the best they can be.\nWhy shop with us? Because we know bikes and we care. We don't sell snowboards, we don't sell kayaks and we don't sell tents. We only sell bikes - you might even say bikes are our life. Why does that matter? Because this utter fanaticism for our product makes us the best at what we do - We live to create cyclists.",
    "I love GitHub been useing it for years",
    "still better than the weird tractor analogy they had earlier",
    "♥️♥️♥️♥️♥️♥️♥️",
    "who made this though?",
    "👏👏👏👏👏",
    "my favorite part is when I went to this video to figure out what github is and at the end I still didn't know.",
    "This video is awesome.",
    "wow nice animation most have taken ages",
    "Koji",
    "love this commercial YaY",
    "Philip Wang, did the Taskmaster get you up to this?",
    "Why do you guys advertising? You guys need no promotion, every company, every developer in this whole world uses your platform.",
    "git hub pull then",
    "Animations are so accurate…",
    "Inaccurate, there weren't any furries!",
    "APENAS HOY ESTOY ENTIENDO CODESPACES HEHEHE NISIQUIERA SE PROGRAMAR",
    "The cat (octopuss) never made an appearance, but a yellow duck did.",
    "Isn't this the website where we can spin up free servers to mine crypto?",
    "Who/what company did this animations?",
    "I wanna watch water movie this is!",
    "The most beautiful explanation so far!",
    "It's the place where they steal your code for their AI",
    "Developed a shocking Ai that talks to me like a human 🎉🎉, excited to show that!!!",
    "How is it even possible to make such a soulless advertisement?",
    "Is that phil wang or am I mistaken?",
    "Just One Line summary Github:  Its a place for anyone from anywhere to build anything",
    "Great video 🎉",
    "GitHub is donations to Microsoft. Microsoft then may choose to respect author copyright or not (see Copilot).",
    "While the production quality is very high, they really wasted Phil Wang’s talent",
    "ducky script",
    "I wish Github's UX was as clean as this video.",
    "It's epic",
    "they make it sound like a new prophet",
    "Wow, such a beautiful promo! And nice blender tutorial references!",
    "The sound design sounds sooo similar to big hero six's techy sequences",
    "I love Github so did the GREAT science!",
    "WHAT ANIMATION STUDIO MADE THIS????",
    "So... iam not Understand... is a SpiWare ONLINE platform who see ALL CODE of you make? hu... so",
    "Is this Phill Wang?",
    "It’s that guy, from Taskmaster!",
    "So in other words, is it like google drive but for programmers?",
    "you nailed it guys we need more 💖",
    "Brother, no CEO has ever committed to GitHub. Elon Musk probably writes his code in VI then faxes it to his team.",
    "Forgot to add the part where you steal our code to train an AI, that you'll charge us if we want to make use of it LOL.",
    "This makes me want to switch to gitlab",
    "TL;Dr GitHub is a front end for Git, just like all the others.",
    "Ok I want a rubber ducky now.",
    "This made me smile. Rubber ducky for the win",
    "Why does a github comercial have such good animation?",
    "we already knew this lil bro",
    "Lol GitHub is so confusing to use tho",
    "It's Phil! Phil Wang!",
    "GitHub is to git, what pornhub is to porn.",
    "power by microsoft",
    "BORING!!!",
    "super secure . hahahaha",
    "Bizarre choice of Phil Wang. I’ll take it.",
    "This is one of the best informative videos/ads I've seen in a while ",
    "So... getting out in front of the Co-Pilot lawsuit. Standard propaganda technique.",
    "Github is missing IPv6 support",
    "Luv me some Phil Wang.",
    "All those ducks look like Blender Gurus millions of donuts 🍩",
    "❤❤❤",
    "school of motion vibes",
    "DISLIKE",
    "Inspired by the movie \"Everything Everywhere All at Once\" from A24",
    "nah bro, GitLab is way better",
    "So, What is GitHub?\n\nDeveloper's Po*nh*b ❤❤",
    "\"we use your code to train bots which will make your job extinct \"",
    "GitHub and VSCode = Microsoft spying on what you’re working on. 😂",
    "GitHub at Disney",
    "Philly Philly Wang Wang",
    "Linus probably feels like a proud dad, watching his little personal project become the most popular platform for developers in the world, that initially was for himself just to cooperate with his fellow developers with more ease",
    "😍😍",
    "I enjoy the rubber duck symbolism throughout this",
    "Thanks for everything. I'll fight for you. Sincerely, a dummy.",
    "It's the best social network",
    "Came here for ol' Philly Philly Wang Wang. Now i know a tiny bit more about github. I suppose that's the marketing strategy working.",
    "haha the rubber duck debugging joke",
    "man i just wanted to know what github is and does not have my mind blown...this is the coolest introduction to anything..",
    "Fantastic .",
    "Really looking good 👍 and awesome 🎉❤❤❤❤",
    "Why are you stealing much of the credit from git?",
    "This is so beautiful.",
    "mm yes hit gub",
    "feels more of a marketing than a \"tutorial\", the  animation and the theme is like a heaven especially the branching part but the reality is its like 2012 movie where the whole world shits and half of the population dies. Thats git 😐 if you git it. 🫠",
    "The narrative just reminds me of the series silicon valley",
    "i didnt know that github needed an AD!!!!",
    "As a non-coder this felt like the advert for a fictional company in a movie that claims to be benevolent but is actually evil and creating weapons of mass destructions. There's something about the way it says so much and yet nothing at all at the same time and trying to distract you with bright shiny colours.",
    "The only excuse I ever made was that i was young and clueless . But I'm getting older and smarter 😏",
    "I’m sold, I don’t it was trying to sell me anything but still I’m sold",
    "Sorcerers orgie tower😂",
    "Came for the title cause I thought Github was like Grindr, and stayed for the visuals. Though the explination was kinda hard to understand, and i used to be so into computers (i still am a bit, into tech actually).",
    "Very cool intro!!!",
    "okay this is pretty much giving me goosebumps",
    "Why that 🦆 looks scared? Coz it saw GitHub’s  🐈",
    "While the production quality of this video is clearly outstanding, I don't think it does a good job of actually explaining what GitHub is. Unless you are already a software developer, all of this terminology and language is going to be completely lost on you. Looks cool though.",
    "I really thought this videos is going to be like the interviews made by @programmersarealsohuman5909",
    "0:11 i see Tom Scott's style there",
    "oh my god, it's a server that hosts git. + chatting.",
    "Damn! That was encouraging",
    "That was awesome",
    "cool, now I added exactly 0 to my understanding of GitHub",
    "Good",
    "why duck, why not octocat?",
    "me, who knows github since 2016 but just remember how important to be registered early. Then now that i wish to have my acccount registered before because it looks cool but i don't remember my email since it was not yet confirmed.",
    "Am I the only one who finds it weird that there are like two white people in this ad?",
    "The hub, but for nerds",
    "road to the future...",
    "Spoiler: the octocat ends up eating the rubber duck :(",
    "cut the cringe already",
    "video is like: OMG!🫨",
    "When Microsoft take a drive 😁",
    "Nice attempt on washing your image but we the people are done with centralized abusive shit like GitHub, the future is a decentralized world were we are the owners of our work and no one else. And despite being open source is not kept by a centralized server that have the ultimate control over it.\n\nJust wait and you'll see someday. Not long from now storage would be so small in size and so cheap that P2P decentralized GIT would just be easy and simple and believe me, we are much more developers than we need to host all that repos in random peers so it's available 24/7 and YOU 👇 Microsoft and other big tech companies would not ever again have the power of controlling and selling our data anymore. Enjoy the future of people empowerment, because the future is now.",
    "Don’t want to be that guy but this ad feels too female focused",
    "Wow, Microsoft did something great for once... Amazing stuff! ",
    "Devs are probably more committed to Github than they are to others.",
    "Nice",
    "Next version with ice cube and Samuel l Jackson",
    "Less bad humor, more explaining why the F i need to learn woe to code just to download some freeware program?",
    "damn I'm a typescript developer.",
    "It can't be. Is that.... Phil Wang?",
    "So the duck is this developer's only friend?",
    "This video converet a simple concept into complicated one 🤦‍♂",
    "ook ook",
    "whoever made this is stupid, didn't explain what it is",
    "Wang",
    "The duck is so cute!",
    "With Github anything is possible,, including its AI stealing other people code and strip author information,, as Microsoft is Github's parent company,, yes this is possible,,",
    "Understood absolutely nothing but enjoyed the video lol",
    "🥇🥥🥥🥥👩🏼‍❤️‍💋‍👨🏼👩🏼‍❤️‍💋‍👨🏼👩🏼‍❤️‍💋‍👨🏼💝💝👨‍👩‍👧👨‍👩‍👧👨‍👩‍👧👨‍👩‍👧👨‍👩‍👧",
    "Can I hack instagram account from github",
    "Github is pornhub for developers",
    "pov: you came to the comments",
    "It’s everything except for white males, haha. It’s so funny how racist and exclusive media has become",
    "I want the Duck!",
    "This makes me excited to use a tool I use everyday",
    "00:02 GitHub is the largest and most complete development platform in the world\n00:25 GitHub is an enterprise transforming cloud-based platform\n00:45 GitHub enables collaboration and innovation\n01:02 Users can create their own branches of code to work together in parallel.\n01:17 The merging process is fast and efficient.\n01:31 GitHub provides advanced security features\n01:57 GitHub is a student learning to code, disrupters revolutionizing music, and a CEO transforming a global company that enables 21,000 strangers to work together to take the first picture of a black hole.\n02:21 You can build anything the world needs.",
    "The easily understandable and emptily attractive, not necessarily the useful. A good ad. Something to learn from, just in case.",
    "exquisite video editing 🔥🔥🔥🔥😍😍",
    "Very cool presentation. Now we know what github is 😏",
    "Millions of developers use it, but your support system isn't helpful 🤭",
    "Amazing production!",
    "keren",
    "where could I get one of those ducks?",
    "Maybe it's because I'm not a coder but this ad didn't explain what GitHub is or what it does really all that well.",
    "Love how they referenced rubber ducky debugging",
    "Well, the animation is soo cool\nBut haven't reached the Coolness level of GitHub",
    "Wang, how much was the duck? did you haggle for it?",
    "maybe the real GitHub is the friends we made along the way",
    "Phil Wang is the ideal person to hire for this advert",
    "Watch it deteriorate over time as the average IQ of users continues to drop, then we'll need to worry about content filters, and all those other things the dingbats have ruined on our internet that we invented and kindly but naively let them use.",
    "You forgot to mention the part where you are resolving merge conflicts. Alone!",
    "Is GitHub's mascot a duck or a cat?",
    "Nice animation",
    "Git by name and Hub by... second name. GitHub.",
    "This was unnecessarily good!",
    "good stuff",
    "crazy video guys :) got me goosebumps and laughter",
    "This I can get behind 100%. You guys outdid yourselves with this video! 👏",
    "Any thing you think the world need❤",
    "This casting just makes sense, literally perfect 😄",
    "Damn This video gives a cinematic marvel vibes👏.",
    "phil wang?!",
    "great intro",
    "Clever digi display but doesnt solves fundamental problems of safety and well let me not say more",
    "this is video i wanted to make \nbut i don't have time :D",
    "Wang!!!",
    "only a DUCK wouldn't know what GitHub is, so stop being a DUCK!",
    "genuine question. why is the duck the main theme of this video when the logo is a cat?",
    "ฉันพึ่งเคยเหนตุนในความผิดพลาดแปลงรัยะหลังนี้",
    "ITT: people who don't know the difference between git and github",
    "🚀",
    "Github and Stackoverflow are the only two real friends for us devs! 100% selfless friends!",
    "That's Phil Wang!",
    "Free cloud",
    "They feel it's so obvious everyone knows what Github is, that they dedicate a whole video explaining just that.",
    "nice",
    "i think the world needsproimity voicechat for an almost 30 year old game",
    "Show this to a non-tech person and they'll still have no fucking idea what it's about.",
    "Everything in the world is in GitHub",
    "I don't like how microsoft is taking credit of the work that Linus and the git team has done, the platform for opensource work is not respecting one of the most important opensource projects ever \"Git\".",
    "I am trying to make God can u help me program it",
    "only problem? owned by Microsoft",
    "GitHub is not the place, it’s people",
    "Phil Wang , comedian . No mention was made that this guy does standup . If you didn’t know beforehand there was no way to know. Makes you wonder why he’s even in this commercial at all",
    "one of the most enjoyable ads i've ever seen for ssomething lol",
    "thank you github we love you :)",
    "its like p*rnhub but for git repo",
    "I was too high for this video; I almost cried; my mother was standing behind me, and I proclaimed, \"We are the duck!.\"",
    "Given britishers say \"Bottle of Water\" as \"Bo'l of Wa'r\", do they call Github as Gi' Hub i.e. does it sound like Gay Hub?",
    "Wait... I thought branching and merging was because of *git* and not *GitHub*",
    "Theres a reason why  hes talking to a ducky, if you dont know look up for \"Rubber duck debugging\". Youre welcome",
    "Open-source championing. What a choice of the word.",
    "aUtomAtic vulnerability dEcEtion XD",
    "That's got to be the weirdest, most complex task ever. 5 points to Phil Wang!",
    "Really really pretty advert. But sorta does not explain what github is",
    "Still don’t understand what exactly GitHub is or how it works lol",
    "I know it's a newbie question, but how do you make sure that if thousands of people have their own branches and let's say twenty people merge their branch within one hour there won't be any conflicting code pushed there? Let's say I used a function from a library to make my code faster, but that library got updated a few minutes after I merged it. Even worse, what if it's let's say not overloaded now because developer noticed nobody used that overload capabilities, so he simplified the code, but my fresh branch uses that overloading in 2% of use-cases? It would create a nightmare scenario that requires thousands of people to maintain a large codebase, while if they weren't able to work in parallel in my opinion, they would work like 60% slower, but the code would need half the people to maintain it, what would save companies millions as maintenance lasts way more time than development. Maybe I am wrong though?",
    "wang...",
    "The video shows how GitHub is a universe in itself.. super amazing video ✨🔥",
    "I'm not a software developer, heck, I am a Botany PhD scholar who'll rarely ever need any software other than MS Office and maybe some statistical analysis tools. What I am, however, is a huge Taskmaster fan. And I am here because I expected the pendulum to draw the eye.",
    "One question, who is this ad for?",
    "Free storage for your crappy unfinished projects.\n[Issue closed]",
    "Wow.... never thought I'd see someone saying too much while saying nothing at all at the same time. What a sorry excuse for an answer.",
    "jeez",
    "I feel undervalued because my race was not included in the spot :<",
    "daamaamn wow\n",
    "Bro be rubberducking to us",
    "I would also like to add.\n\nGithub is a rite of passage for all developers. We've all done that one push :D.",
    "Wow!",
    "They didn't like invent git",
    "If Phil Wang wore his yellow onesie, this video would have twice the views by now",
    "The way this video is made makes me happy.\n",
    "почему меня не могут добавить в организацию",
    "It's just a git server. Get over yourselves.",
    "This is so beautiful I almost cried 😢",
    "2:19 ...But out platform is still closed source",
    "Joix, github told me a lot about how to code with code and that change my life 😊",
    "Hello",
    "video is so mesmerizing",
    "The duck is looking.",
    "Great promotion. On my way to download Blender now.",
    "Platform that abused user code for AI. yay!",
    "The rubber duckie is so cute. I am sure it doesn't have any menacing plans of making us worsen our code and eventually rule the world.",
    "Nc1\nHello World",
    "Now this is content omgggg",
    "Wholesome!",
    "Wow I wanted to learn GitHub and this is amazing",
    "That's their whole marketing budget right there",
    "I just developed a downward wifi system 🎉🎉❤",
    "excellent intro video! 😄",
    "Probably one of the most educational and visually stimulating demo I've seen!  Well done!  The touch of humor is just about right.",
    "It's really crazy how insanely influential Github is, and how much is users impact the world, yet most of people have only heard of TikTok.",
    "Where can I get that rubber ducky? I need 100 for stress relief.",
    "just lit 🔥",
    "Believe it or not ... Am seeing this video as i am currently downloading from github for the first time",
    "It sound like big hero 6",
    "Thanks, but I'm gonna stick with Git-r-done Hub for now",
    "Horrible review. Doesn’t answer the main question. Very vague.\nThe 7 minutes overview from Code Institute is way way more informative.",
    "cool🥲",
    "A very good video to show why marketing videos have very poor records on view completion stats.\nI bet that it is <5 % of viewer did last till the end.",
    "The marketing is impeccable",
    "1st?",
    "Holy shit you've made me actually want to learn to use github and use it I don't know why but I want to genuinely you've dropped a banger animation this shit is beautiful  was thinking this is like a discord commercial but its better",
    "guy_with_duck: Do you know...\nme(whos_changing_profession): Ohh sht, here we go again...",
    "Next up, what is pRonhub?",
    "I think I need a nose ring to join....",
    "It's Phil Wang.. everybody. First name Phil.. last name Wang. Phil by name Wang by second name.",
    "best gayhub😂",
    "love it",
    "This corporate style animations makes me sick",
    "Shameless plug. Too bad their GUI only runs on Windows and Mac. You would think that with most of githubs projects running on linux, their GUI would as well.",
    "Ok so what is Github?",
    "Well the host seems like the perfect programmer ever,Indian and asian(SE) at the same time.",
    "The duck has always reminded me of the tank.",
    "Oooooo this gives me chills!!!",
    "Wow it's good",
    "Sounds like an ad for an nft marketplace😂",
    "You had me at Phil Wang",
    "Yeah, I know but I can’t find the download button for repo releases unless I’m on desktop",
    "Never expected to see Phil Wang promoting Github of all things, haha. Pleasant surprise.",
    "Bro thinks Im a duck",
    "RUBBER DUCK TECHNIQUE LMAOOO",
    "I only watched this for Phil Wang",
    "Didn't expect to see Phil \"Yellow Onesi\" Wang here",
    "I want to learn how to use github",
    "Give these animators a raise",
    "I see many playful, yellow rubber ducks at every turn, but after watching this video I still don't know what GitHub is.",
    "sudo drop database ms.github—noconfirmation",
    "But is the logo a cat or a duck?",
    "Code harvesting anyone?",
    "TAKE MY MONEY!!!!!",
    "Way to explain absolutely nothing.",
    "I love this video ❤",
    "Ok, but what is github",
    "This video is so misleading.... git is just a tool",
    "Well now I seem slightly less boaring",
    "The level of video production is amazing 👏😮🐤",
    "🦆",
    "Who directed this video? Spielberg? It was great!",
    "Thats how you fuckin make an ad",
    "It's Time to believe in God of the bible",
    "This kinda hittin' like one of those overly charismatic companies in shows that is revealed to have sinister intentions later on.",
    "where is the video about the tractor?",
    "Will Code Pilot open its API to other editors like Panic Nova? That would be so awesome!",
    "Somehow animations looks similar to Microsoft",
    "Why is this so good",
    "Salam 3lecom",
    "git push origin master --no-verify --force",
    "Exciting than a movie!",
    "❤",
    "I dont see even a single negetive comment. Way to go Github",
    "It seems the multiverse is everywhere these days. I can't wait for it to hit the theatres.",
    "why did I click on this? I don't know.\nWas I disappointed? certainly not",
    "that microsoft money hard at work",
    "They really took the Discord marketing and applied it to Github",
    "I love the way this video was made. It was very friendly to the viewer. Kudos to everyone who created it!",
    "I didn't know that what I was doing the last few years is that epic.",
    "🖤🤍",
    "Would have been better if he was wearing a yellow onesie",
    "Yes, even in Russia",
    "And he's talking to rubber duck, because you know, we have rubber duck debugging in SE.",
    "🖤",
    "after watching this ad, I suddenly feel like writing more code.",
    "Does anyone here know what GitLab is",
    "you made me cry..... the many faces made me feel like i was one of them......bravo to the mind that made this video",
    "Fantastic video!",
    "I'd love it if that duckling became the new mascot. huh!",
    "I have seen the outline of this man's genitals in a Bruce Lee costume.",
    "Is this animated on Open Source software called blender?",
    "why they use a duck instead of a cat or octopus?",
    "why is phil wang here",
    "Who's the guy in this vid? His face looks familiar but I can't quite place him.",
    "Phil Wang!",
    "can’t wait to watch this film",
    "Asian hangout place",
    "I still don't understand what GitHub is",
    "❤ 0:34",
    "wow, that's awesome, only issue is I don't do programming nor coding :/",
    "philly philly wang wang",
    "How are you doing is my app",
    "Apple will copy it and blame Android",
    "That was cyberduck",
    "The coolest intro video I've ever seen. 12/10",
    "Ok now in Spanish for my parents 😅",
    "The duck did not ask for this!",
    "I still don't know what GitHub is after this.",
    "It’s controlled by Microsoft so I wouldn’t set my future expectations too high…!",
    "Love the reference to the rubber ducky technique!!",
    "Every thing you need to start Python:\nhttps://youtu.be/-xVhFMNdGR0?si=RQtwkSu6Znv_xXeb",
    "Thank you!",
    "Uhm @GitHub It Would Have Been Nice If Y'all Used The GitHub Octo Mascot Instead Of a Duck.....But Either Way, Pretty Informative. Thanks.",
    "I found this while trying to find out what GitHub was, guess I’ll keep looking",
    "Oooh! Phil Wang! Nice! 😍",
    "this is beyond beautiful",
    "I feel like everyone should use GitHub.",
    "How the fuck do you make this",
    "google cll 14.16.27.28.arm64 sürüm google chrome açarken chrome-native://newtab 116.0.5845.92 android 13; 23117RA68G Build/TP1A.220624.014 Google LLC 2024 yasal bilgiler Google Chrome uygulamasında chrome://credits sekmesinde github kaynaklı apache 2004 license kaynaklı lisanslanmıştır  bunların otomatik  kaldırılmasını istiyorum internet erişimim oldukça yavaş şikayetçiyim bu konuda saldırganların bulunmasını cezalarının bulunmasını istiyorum 81/2024 dava dosyam T.cumhuriyeti karşıyaka cumhuriyet savcılığına bildirdim ancak maili aşağıya bırakacağım  mailime yine saldırı yapılıyor bu yüzden pek girmiyorum bilginize sunarım",
    "Classic.",
    "3/10, too many women in the presentation.",
    "I clicked because of Phil Wang",
    "so is it like ubereats (i didn't watch the video)",
    "Once one of my friend told me,  what pornhub is for porns , github is that for gits.",
    "W ANIMATION🔥\nW NARRATION🔥\nW PLATFORM🔥",
    "The aesthetics are so coooll!!!",
    "Ah, yes. less informative and politically correct ad for foss community. just what I needed.",
    "Animation directions: NO WYPIPO!!! ❌❌❌❌❌‼‼‼‼‼‼",
    "They are describing git, not github lol",
    "Love this AD :D",
    "wtf? why Phil Wang? )",
    "sus",
    "*透過小鴨除錯法了解什麼是 GIthub*",
    "Então",
    "Was this made by pixar? Be honest.",
    "What an endearing portrayal of Microsoft's code-harvesting engine.",
    "I watched this but i still dont understand what is github exactly?",
    "basically, it act's as a host",
    "николай ни бухай",
    "Woah, that was a really good ad.",
    "I say! I am equally impressed with the graphics and the fact that you got Phil Wang to do the commercial.",
    "Oh,my dear,it is great.",
    "When you realize its front end for git 🗿",
    "AI : hold my beer...",
    "Wow 😮😊 MashaAllah",
    "But....what exactly is GitHub?",
    "It's a whole different experience to watch this when you're high ngl. Especially for someone who comes from non-tech background but somehow understood what the video was about. Great work 👍",
    "Coal importing companies aren't software companies. Or shoe repair shops. Or bike shops. Or Taxi Drivers.",
    "huggingface is better",
    "omg i need github, please give me one",
    "that was motivetional",
    "D U C K",
    "in short its just a storage space.",
    "Seeing Phil Wang's face on the thumbnail, at first I thought this was a parody. 😅",
    "ESPETACULAR !!!!!",
    "Philly Philly Wang Wang! Half Chinese, half normal..",
    "Stack OverFlow > GitGub",
    "Why not a cat instead of that duck in the video...",
    "I love the ending so much",
    "If anything's possible with GitHub, then why can't i get a girlfriend? Or, at least one that i didnt code using GitHub.",
    "what is up the duck tho i dont get it",
    "The difference between git and GitHub is the same between porn and PornHub :)",
    "It's a place for anyone from anywhere to build anything, Anything You think THE WORLD NEEDS",
    "That's cool and all, but what is Github?",
    "only the true programmer can understand what a revolution  is  GITHUB .",
    "Nice video 🔅",
    "The rubber duck was an amazing reference. Great video.",
    "Oh My GitHub, this is so beautiful ✨",
    "As a non developer can someone explain to me how the different dev branches merge back together without causing conflicts in the code?",
    "They also have the logo of our true overlords - The Cats",
    "He got the whole way through without saying his name!",
    "I just joined now, and I just have very basic of javascript and Dart, will see after one year how much will improve inshalla.",
    "This told me absolutely nothing about GitHub.",
    "Nicee!!!",
    "Love y'all, but you just had to be owned by that giant thieving stain Microsoft",
    "es impresionate el video lo mejor, es muy bueno, sos el capo del mundo!",
    "Incredible presentation! wow! 👍",
    "Thank you GitHub",
    "GitHub is actually so big.",
    "That was fucking awesome!",
    "What's a Wang doing in here?",
    "I’m more confused now cheers",
    "Money well spent on this animation",
    "“opensource driven” yeah but ya stole it didn’t you",
    "i cried",
    "you all made a huge mistake removing the old tractor video",
    "GitLab is so much better\nBetter Ci, rules, Interface, ability to create folders for the projects and so on\nPlease stop",
    "so... Github is the metaverse?",
    "wow this is cool",
    "is that wang???",
    "What is GitLab?",
    "Who is this aimed at, anyone who understands alot of those terms would not need this video and anyone who doesn’t understand those terms would be confused af?",
    "this except the security stuff just describes git not github bruh...",
    "Wow",
    "yes i  duck -for duck",
    "github is stack overflow for larger projects you want to \"code\"",
    "GitHub users, are naively helping to train the AI that is going to leave them out of a job! 😢",
    "Another crypto?",
    "so amazing!",
    "This is the best thing since binary trees",
    "Nice duck",
    "all they said was github is a place for *the* projects WHAT THE HELL IS A PULL REQUEST AND HOW DO I MAKE ONE",
    "thank you for make it free",
    "Wang!",
    "Sadly, the major functionalities of Git are labeled as functionalities of GitHub.",
    "Too much money 4 marketing, this company will not be about THE prodct as it was before MSFT bought it.",
    "wowowowow",
    "I fucking hate guthub.\nNo one but nerds can figure out how to download and install shit unless they are a professor computung nerd.\nFuck off.",
    "i love GitHub",
    "2 min and 42 second  , still I don't get it what really is . And also the duck!",
    "A open-source company owned by Microsoft",
    "ah, i remember the days of trying to figure out what's git and why is it different from github",
    "Insane.",
    "Thank you",
    "nice duck",
    "avenger:  to the past and an alternate timeline. \n\n me: create a branch",
    "I NEED THAT DUCKLING!",
    "So it's a tree?",
    "Wjy I'm getting goosebumps?",
    "I dont event use github but I know pretty much everything uses codes from it",
    "I hope Elon Musk doesn't buy it.",
    "Where can you buy this duck?",
    "I'm still not sure what it is... Is it like nondestructive coding where you document different versions of a code for the entire team to jump in and out whenever they want?",
    "This video makes me to believe in myself to become a better software engineer.",
    "What is GitHub?\nA company that trained their paid AI co-programmer on community code.",
    "This is well done !  Everyone uses GitHub right?",
    "It is...",
    "Thank you for GitHub! Awesome project.",
    "Gitlab >>>>",
    "Damn i cried.",
    "bitbucket es",
    "2:10 when the code compiles first try",
    "Talking about the coding and stuff, and no Indian involved? This is impossible. Lol\nAs here Sonal ( it's an Indian girl name)",
    "Who is this ad for?",
    "is this duck going to be a mascot?",
    "Every time I merge there are conflics",
    "holy SHIT that was gay",
    "Imagine all that while an AI crawls your codebase stealing everything regardless of license",
    "He’s that Malaysian standup comedian?",
    "Is that mew on your logo?",
    "Funny how they call it a merge and not a stupid fucking pull request which makes no sense.",
    "Feature request: put secret scanning in GitHub Desktop so it can warn you _before_ you commit secrets.",
    "All the animations were done by highly professional amateurs, please don’t try this at home",
    "Loved that they used Phil Wang. 10/10",
    "yeah yeah like all m$ products it’s becoming a fucking buggy, untested bullshit. Just look at m$ teams. It’s a fucking skype with a custom theme, that’s what it is. But with new client written in electron. Horrible ux of teams makes me want m$ go bankrupt",
    "页面通用",
    "It's probably from one of those ads which you will will to watch till the end.",
    "for non-coders fellows, github is a place to save your projects with the ability to give access to others to help you with it, as simple as that.",
    "“It’s 21,000 strangers, working together, to take the first picture of a black hole.”\n\nI wasn’t expecting to have my heart strings pulled, but here we are.",
    "I kindda want to see a movie with this animation",
    "Love some Phil!",
    "Phil Wang!  😂",
    "Its Ducts...Ducts in a row!",
    "I just fell in love with this platform 🥰",
    "Our sense leads to GitHub itself",
    "GUYS I FOUND AMONG US 1:16",
    "Look, it's the Taskmaster Guy.",
    "They certainly know how to use that Microsoft money",
    "WOW! What a great video animation. I love it!",
    "git hub has best trailer than disney movies",
    "one of the best introduction videos I've ever seen",
    "Me, who only uses github to transfer files from desktop to laptop and has never used 90% of the features: *oh cool*",
    "24 FRP?🧐",
    "I am wondering why did they use a duck instead of a cat.",
    "bekar h is se acha kch acha game bana lete bc",
    "This is beautiful",
    "Cool!",
    "i use gitlab",
    "copilot!",
    "too bad youre being sued for breaking OSS licenses by feeding public code to your fancy pantsy AI",
    "Not a crossover I expected lol",
    "Not a single reference to Linus without whom none of this would be possible.",
    "Nice animation than info..",
    "@BenMarriott check this out",
    "Oh look Philly Philly Wang Wang",
    "But, What is GitHub?",
    "And not a terminal in sight!",
    "Feels nice to be a duck",
    "Github🥰",
    "I didn't know GitHub needed an ad but this is great",
    "没中文吗，兄弟们】",
    "Phill wang!",
    "Github is like ZornHub, but for gits",
    "Github advertisements quality in software developer is more like Apple's ads in mobile tech industry 😂🎉❤",
    "I know GitHub. I just watched this because of Philly Philly Wang Wang.",
    "Phil Wang in a GitHub advert? This piqued my interest as soon as it was in my recommended.",
    "GitHub essentially is the most, probably even the only, useful social network in the world",
    "What most exciting video. Pretty well explained for every person regardless if that person is from dev world or not!\nNice!",
    "Hardly complete. Excels at hosting Git repositories but the other features could use some re-thinking.",
    "What a beautiful video",
    "\"super secure\" hypixel skyblock players getting ratted all day every day \"not me just the kids that download bad mods\"",
    "If I keep using Github would Copilot replace me in the future ?",
    "What is github again ...",
    "When is the series coming out?",
    "A shit Gitlab TBH. Also, WTF is a pull request? Its a merge request.",
    "This is more of a movie trailor than a GitHub tutorial",
    "Send a thanks to Linus Torvalds",
    "But why GitHub used a duck instead of a cat same in their logo?",
    "Everything super only about god please remove, it did not happen during or after his death, breaking the connection",
    "Please return that legendary globe to main page",
    "Amazing video! Loved it",
    "woohh!! nice ad :D",
    "This is way better then I thought it would be!",
    "github is the storage medium for some of your ai training data.",
    "Honestly, reboot of the original... and done with style!",
    "I gotta admit this video was better than I expected it to be",
    "😍😍😍😍",
    "Okay yeah I know how the duck felt cause when I found myself on GitHub I didn't know WTF it was",
    "she was walking while coding",
    "It's porhubs sister company",
    "Awesome ❤❤",
    "I demand a Github TV series!",
    "copilot is fucking paid",
    "Github has one of the best animations",
    "This creative movie detailed ass commercial. This shit is tooo clean.😂",
    "\"This is my branch, an alternative timeline where I pretend to get paid for my open source work.\"",
    "Make a local version out of github, where all Software is running on local Servers. Otherwise we will be using Gitlab.",
    "Is that a duck on the Github logo? I always thought its a cat :@",
    "Nice video, now tell me what's GitHub?",
    "Even for archiving old and rare app?",
    "Where you get money to run GitHub?",
    "dsfsdfds",
    "you know what a git is, I hope?",
    "They really wasted their money huh. You literally listen to use GitHub in colleges.",
    "thanks helped alot. and very cool animation!!!!",
    "GitHub is 90% of my code. Rest 10% are comments below",
    "Amazed by the Vid, Who's the Director?\noh.. Forgot.. Github is already awesome, I don't need to say it.",
    "DAYUM",
    "not the most safe platform they got hacked and a lot of project are encrypted with runsomeware💀",
    "I wanted so bad to see Octocat in this animation.",
    "its amazinggg",
    "This is amazing",
    "that creeps me out",
    "what's a Development Platform?",
    "Of Twitter gets destroyed from Elon musk just let us switch to GitHub issues & discussions 😂",
    "I give you the most simplest explanation:\nIts same like porn and porn hub",
    "What is GitHub? \nIt’s somewhere you go to steal code because you can’t be bothered to code it yourself",
    "Phil Wang yeah!",
    "I just signed up for git hub. I am on a sleep walk.",
    "So, \n\nWhat is GItHub?",
    "being a dev changed my life, got a bit teary eyed watching this, not only is github amazing, but copilot as well.",
    "ok",
    "This video is very nice, but I really think you ought to credit Phil Wang in the video description somewhere.\nDang it, where's the PR button on here...",
    "GitHub was good, now it's like Facebook: just for the boomers",
    "GIT.  - global integrated terminal. \nHUB - consider a place where more people meet.\n\nJust like in our computer we have an \"terminal\" ( ex powershell, bash software) to interact with the operating system. To access information work on something. And to use the hardware components.\n\nWe do the same. In github.\nBut here \nWe try to connect with an international (online or cloud) operating system (ex a codebase r) where multiple people can interact, change the code(by request), copy the code (locally), or try something different parallely(branching).\n\nSince the code is online most people can visit and reach bigger audience and gets bettter updates. If open sourced.\n\n\nOr a team can work freely without worrying about going to office. Previously the cobe base is stored in an office. Or accessible from office.\n\n\nI hope this would have gaven better explanation than the video.",
    "Is GitHub moneytised",
    "is that phil wang?",
    "How to make an advert for something that doesn't need an advert.",
    "WANG!",
    "that duck must havee next level coding experience to just stare at him and decode his brain",
    "This is a very good advert - that is all.",
    "The music team out did themselves on this one",
    "Phil Wang being the face of this advert is so funny and bizarre to me",
    "Yeah definitely an evil corporation",
    "Awesome branding.",
    "Rubber duck debugging is essential now xD",
    "As a fellow developer and rubber duck addict, I LOVE THIS SO MUCH",
    "Was using github, this convinced me not to",
    "Yeah but, why Phil Wang? not complaining.,",
    "i love the way they presented Github in a cool way",
    "-Someone : So what's GitHub ?\n-Me after using GitHub for many years : I'm not sure yet..",
    "Microsoft's Code Laundering Engine",
    "Do You Think I am a Duck???",
    "everyone asking what is github\nno one asking how is github",
    "The animations and style is marvelous!",
    "Woke trash",
    "I love github!!!",
    "Wangers!",
    "vid made me hate github",
    "Would some one assist me ? I have been trying for two months to get this out. I am an old dog having hard time with new tricks/Technology. I Kindly ask. - Press Release; \n  ChrisP Gavin,  Master guitarist will be releasing his second album in\n early June 04 ,2024. titled , \" No-One Plays Guitar Like I Do \".\n   Featuring a spectrum of Country genre's  and a unique and masterfull\n style of guitar playing encased in a Melodic and Harmonial  vibe that\n really does 'touch the senses' giving you music from a real Artist and\n an instrumentalist capable far beyond his years.\n\n  Music Albums like this are few and far-inbetween. Seldom is found,\n so many awesome styles and tracks all in one album. 17 song tracks with\n a whopping 55:24 minutes of pure musical enjoyment.\n\n  ChrisP Gavin's first album ( release-2015 'Live To Play' )  was a\n European, Australia success. It is still a mystery for the amount of\n sales success and large amassed following , there was little impact or\n coverage of ChrisP's album here in the U.S. of A. \n\n ChrisP's private Label;  'Buddy Boo Records' was said to have been too\n much of a distraction for other Major Labels.  Which made air time and \npromotional avenues a bit too risque for the competition.\n\n  \"No-One Plays Guitar Like I Do\" will be available at more that 200 \ndigital and physical locations throughout the continental America's ,\n Canada,  Europe , Australia , India and Asia.",
    "Hope Microsoft won't spoil it like Skype for example.",
    "This gave me goosebumps",
    "cool video love it now i feel more comfortable building with github☺",
    "3 minutes ago i had no idea what github was. Now I stll have no idea.",
    "Some one send this to elon.... seems like his not aware of git...",
    "It is a duck!",
    "GitHub is life",
    "👍🏿",
    "That was Great",
    "Literally, anything?",
    "Olá, chegando por aqui agora. Nem sei como vim parar aqui. Estava seguindo um vídeo de criação de robô para mercado financeiro.",
    "The video is well animated but told us nothing\nThe terms there are scary for beginners",
    "Why drop a commercial NOW?",
    "Wow entertaining",
    "Its just another tool to assist in the global mission of forwarding spreadsheets and hoping you arent the one at the end of the line.",
    "I only clicked on this for Phil wang",
    "its a place to host your code and then get it stolen by microsoft, breaking licenses and betraying the trust of coders worldwide",
    "All I want to do is read instagram on my mac. Not interested in all this stuff. Anyone out there know how to do this simple thing?",
    "GITHUB IS INSANEEE!!!",
    "When Github and Fortnite make a kid",
    "It still doesn't explain the cat-head octopus?",
    "Alegria on meth",
    "What is github? IT'S A LIIIIME!!!",
    "you are time variance authority of MCU",
    "had to make it super woke with no white guys lol \nyea like its just black gender neutral women and lesbians that do software🤣",
    "lmao at the characters in this video...totally not representative of who is actually doing most of the actual coding.",
    "Great and great .............",
    "Judging by your icon i am thinking of an cat cafe but why there are ducks",
    "bro , the editing and presentation is next level",
    "Smart Guy - What is Github? It's the largest, most complete development platform in the world. \nRubber Duck - (Full of expressions) Are you sure? \nJacky - I'm pretty sure :) Cause I use it too. lol",
    "Gosh, I love that ad. It's incredibly well done, powerful and just all out wholesome. Huge kudos to everyone involved!",
    "This was unnecessarily beautiful",
    "I think the world needs an automatic download tool for when you like a video on pornhub.",
    "They shlda had him and the duck talking on an online meeting, and on the ending scene it shlda been \"whats that? I was on mute? Well that's embarrassing...\"",
    "You're just the neat cloud place to store my git repository. 99% of the useful functional is from the git project.\nThat's branching stuff is how git works. Why git is not mention here?\nAlso, why not mention how you stole the code in repository there to create Copilot that suggest everything without care of how code license works?\nAlways \"Embrace, Extend, and Extinguish\" doesn't it?",
    "D U C K S !!!",
    "Hoarding 90% of the world's open source software without being open source yayyyyyyyyyyyyy we looooove freedooooooom! Repeat after me: we love open souuuuuurce!",
    "This is awesome",
    "Is that Phil Wang??? Jumpscare seeing him in the thumbnail lol",
    "I don’t know why but that ending kills me 😂😂",
    "you guys should make a movie some day",
    "The prettiest introduction I ever seen",
    "It's a shame that GitHub is property of Microsoft, I really don't like the policy of the company",
    "Why duct not octopus???",
    "I can’t even sit through this! It was so excrutiatingly (and perhaps purposely?) vague.  “it’s a thing many companies use, and programmers too, it’s important to writing code ….”  So, it’s a keyboard?  Jesus, get to the point.",
    "so simply put, github is a secure and free cloud service",
    "If only it actually looked and felt like how it did in the animation",
    "I ❤️ github",
    "Please, Foie gras my AI ! 😂",
    "So gorgeous 😍😍😍😍😍",
    "Please tell me Which software was use to animate.",
    "he should have filmed this in his Kill Bill outfit",
    "The explanation was really necessary.....After 14 years",
    "creative video",
    "Wait, Phil Wang?",
    "The duck ;-;",
    "Dark Energy????",
    "this made me more confused than coming in.",
    "Love the animation",
    "i use github for save my image to my repositories",
    "Oi sou um novo aluno do curso muito obrigado pela explicação",
    "This almost made me cry 🥲 it’s beautiful",
    "Github is my favorite programming language.",
    "This video literally brought tears to my eyes. I'm still a G though. 😎",
    "but really i dont know what hithub do , i have heard\n they can provide redimade codes",
    "Thats an insane good introdution",
    "Can i make Food there ?",
    "This video can only be understood by those who already know what github is, to a newbie it is bull shit fullstop",
    "This is a GIT commercial :D",
    "This felt like watching Spiderman: into the spiderverse again",
    "Looks like the Arcane series",
    "GitHub: a company that steals your code to build an AI tool then charges you for it",
    "In otherwards Spaghetti sting your code. OK",
    "ahah)0",
    "how is this so high budget",
    "Gimthub <3",
    "As developer, I used to love GitHub. Then Microsof acquired it and I thought it's over. Luckily it's still thriving, and I love it. I guess there is at least one thing Microsoft acquired, and didn't ruin.",
    "i still dont get it :D",
    "The end really sums it up quite well.",
    "im inspired. lovely art too",
    "Phil Wang is an international treasure. Also GitHub's good, I guess ;)",
    "Github _is_ amazing, this video undersells it",
    "Mr. Phil Wang haggled for this video",
    "I don't understand, I like the video, but I couldn't focus on the matter, is it only my problem?",
    "Was this done by the same animators who done Windows 11 marketing campaigns?\nMicrosoft never fails with advert animation, but actual product :(",
    "Best GitHub tutorial ever",
    "\"The most complete developer platform in the world\", after GitLab.\n\n\"Open source championing\" that is not open source itself.",
    "which app did you use to make this video animatiom",
    "This was epic. Really loved the duck",
    "Let's commit to it.",
    "\"How many rubber ducks do you use for each program on avg?\"\n\"How many breads have you eaten in your life?\"",
    "So why \"GitHub\" doesn't have verified youtube channel ?????",
    "We also spy on your source code.",
    "Where's the Octocat?!",
    "Microsoft acting like they wrote git",
    "This is what they do when they have too much money",
    "WANG! Phil wang.",
    "I use it as a cloud for my files, easy to upload and update, that's all.",
    "these animations are beautiful",
    "Open source GitHub and then talk about open source software being great. \nWhy would anyone want to host their open source project on a website, that isn't open source?",
    "คุนตวรแยกฉันไม่เคยเหนแต่ฉันเคยเขียโค้ดฉันเอไอ",
    "super cool video",
    "Thanks YouTube algorithm",
    "Phil Wang, did the Taskmaster make you do this?",
    "Impressive creativity and talent but this won’t help a newbie lol. You just gotta use it I’ve rarely seen anyone explain it well.  \n\n90% of this wasn’t what GitHub is and more art than instructive lol",
    "omg my mind was literally swimming 🤩🤩🤩🤩🤩🤩",
    "As a developer, thank you GitHub. I appreciate you. ❤",
    "Absolutely beautiful!!",
    "Me atrapaste, es cine... 🚬",
    "yeah it really looks like those ads of corporations in films about utopia. so, is it evil or good?",
    "This video give me chills 🥶🥶",
    "Impressed by the animation & presentation of Github and less by Github😂",
    "5 years using GitHub over here. That was beautifully presented. I almost teared up 🥲",
    "Difference b/n Git and GitHub\n\nGit is like Porn\nGithub is like PornHub",
    "Phil wang",
    "Why is Phil Wang telling me about GitHub?",
    "yess phil wang, secure that bag",
    "Can i learn python with GitHub",
    "Too little representation of all the middle aged beared, white/asian/others grumpy coders using it.  We feel discriminated",
    "Great presentation, great illustration. Long life GitHub !",
    "I use gitlab and github. But I use gitlab more often...",
    "This happens when you advertise air",
    "Gayhub",
    "Damn this is blockbuster level ❤️💯👌",
    "\"we merge instantly\" - famous last words",
    "Git commands are just ew generally...",
    "I think this should be an ad on super bowl",
    "разработчик привет я твой ярый фанат",
    "Giving me the chills",
    "A server Sofware or a window, bit confused and is researching more.",
    "If you haven’t seen Phil Wang special on Netflix, well, you should",
    "Me, who only using it to download programs to jailbreak consols.",
    "WORST explanation",
    "Conflating git with github to trick unknowing CEOs into giving up their code.",
    "what is github? its like pornhub for nerds",
    "Not expacting Phil at all",
    "A place where open source code is stolen to train an AI which will soon get Microsoft and Github into a messy legal battle.",
    "One of the best introductions I’ve ever seen",
    "Interesting i think i might use this to create… well if i succeed the world might eventually know it so let’s be silent for now.",
    "1:15 So, when we're ready to merge? We merge!",
    "Where do I get this duck!?",
    "What was even the point of this ad?\nAnd they forgot to mention they love stealing stuff which resulted in the Copilot lawsuit",
    "github is just free storage 😈",
    "Hey its philly philly wang wang",
    "Duck",
    "Where can I get exactly this duck? 🥺\nThe reference to Rubber duck debugging was genius.",
    "this is soo identical to kurzgesagt's The Egg video",
    "You could've at least put the real person that took the picture of a black hole",
    "je veux dire merci a toutes la communauté, c'est grace à github que je touche du bout des doigts l'infinité de possibilité que la plateforme offre, là ou la seule limite est le desordre dans mon esprit ^^. Je rêve d'une Afrique qui saisie l'opportunité sans precedent de l'open source pour rattraper le retard qu'elle a accusée et même pourquoi pas proposer sa propre vision du futur .... love yall",
    "I always pronounce Github as gi-theb",
    "I prefer gitlab!",
    "So in short github is basically instagram but you share files and folders of any type or coding language and people can view / edit based on your needs",
    "Well what is github without the invention of git.",
    "Hello fellow kids",
    "Bitbucket is better.. 😅",
    "wow, this video is very powerful",
    "Phil haggled to be a part of this video",
    "😂",
    "Why did I just randomly click this video",
    "its very exciting",
    "Why is GitHub",
    "KOJI",
    "This video didn't help me understand 'What is GitHub?'.",
    "wang",
    "Can I get a link to this duck on Amazon?",
    "Sounds good)",
    "Hi",
    "This video is just amazing, great job guys!",
    "This doesn't really explain what GitHub is. When I was getting into web development I really wish I knew what Git and GitHub were. I feel like you're not hitting your target audience for this video–this speaks in a way I think only more experienced developers would understand, and those people are already using GitHub every day!",
    "Better than Discord ads?",
    "thanks for (mostly) marketing git features as githubs😂",
    "Wtf. Why are GitHub advertising? I want to meet a programmer that doesn’t use it",
    "Philly Philly Wang Wang!!",
    "✨It's a place  for anyone from anywhere to build anything ✨",
    "This is not github. This is git. Y'all are wrong for taking git as your own work. Self-host or use non-proprietary git servers guys.",
    "the ANIMATION",
    "Linus Torvalds didn't die for this.",
    "I thought this was neat, then I reminded myself GitHub is a proprietary platform on top of Git.",
    "ship it",
    "W Github",
    "The duck is so cute! Where can I get them?",
    "github is the place to date femboys",
    "a female programmer that squashes bugs, best joke of the video.... BY THE WAY, USE FUCKING GITLAB, GET AWAY FROM MICROSOFT CLAWS OR GO SELF-HOSTED.\nThis has been a patriarchal message bought to you by me.",
    "As a layman, I am even more confused now. Tech explained with more tech.",
    "you didnt even mention git.",
    "Por que un pato?",
    "'I would rather use Google Drives than that calamity of eye piercing displays that do not make any sense whatsoever...' - Chrome",
    "hear me out... i think the duck isn't real",
    "This video merged into my heart",
    "Silly GitHub, not knowing what their own website is!",
    "dare i say it 💀 better advertisment than Discord's\n\n\nnah probably not. a close one tho",
    "I have a lot of apprehension re this commercial.  1. No where does it mention for the betterment and benefit  for all people. 2. The snide rreferences to going to Mars rather the coat did seems to reflect the belief the usa did mot go to the moon. If so this is a low blow to our Republic. 3. The knight gets hit on head at end. Inbestment firm with many clients invincible being breeched by an unsuspecting underdog?",
    "They used rubber ducky instead of cat the real git😂😂",
    "Going to be honest I want that duck looks very good",
    "wow！ cool！",
    "Most easiest explaination\nIf git = porn then,\ngithub = pornhub",
    "It is a parody organisation of pornhub",
    "It's Phil Wang!! The Wang Man!!",
    "I finally clicked the video that keeps popping up every time I login to my account",
    "Philly wang wang!!",
    "That was amazing. Thanks for making engineering cool again🤝",
    "Whenever I have to explain GitHub to someone, I tell them it's like saving in a Pokemon game.\nYour roster is frozen and saved, and you can go back to any previous save point you want to.",
    "Can’t wait to see how GirHub leaked privacy",
    "Where can I get that cute yellow duck",
    "This was incredible",
    "💗💗💗",
    "It seems I only understood this \"explanation\" because I work in GitHub, it makes no sense if you are hearing about it for the first time",
    "I want that duck!",
    "فدشي روعة",
    "So did github build.. github?",
    "Celebrating 550 decades of hacking on an app of soucecode and sourceid",
    "Github is Microsoft...nuff said.",
    "If github commented, I would start coding daily.",
    "Still dont understand!",
    "And i am a user😅😊",
    "??? WT??",
    "something that will make me feel like a complete moron and bash my head against a sharp rick for hours until it finally works",
    "after all this effort, I still have no idea what GitHub is.",
    "the hub really made a video of what is github",
    "So, does Github use Github?",
    "Quite strange they used Duck in the video instead of other animal in GitHub logo? 🤔",
    "The duck from telegram....",
    "GitLab.",
    "Didn't expect Phil Wang!",
    "Where can I get this rubber duck for debugging?",
    "incredible!🥰",
    "I still don't get it",
    "DUCK!!!",
    "Stunning video",
    "Beautiful",
    "I was really hoping this would have just been like a joke video, like what discord does with their \"We removed light theme\" style videos, the duck joke was funny but after that... eh coulda been better.",
    "Git repo hosting, static site hosting and social media",
    "What is Phil Wang doing here lmao",
    "Maravilhoso",
    "I like Github, but this ad is kind of saucy. Not my cup of Java.",
    "Wholesoms",
    "love it. Well done!",
    "Nice commercial",
    "Love the animations!",
    "Github is not open source though kinda cringe. Cool animation though!",
    "This video does not answer the question \"What is GitHub?\" to someone who is starting out in software development. It's just a commercial. Can't say I'm surprised coming from this channel, that's unfortunate though.",
    "GitHub is great",
    "PHIL WANG\nphil by name\nwang by... last name\nPHIL WANG",
    "Cute duck :)",
    "Unfortunately, it's owned by micro$oft now.",
    "This ❤",
    "Microsoft tho...",
    "Right now my eyes turned in 🌈 effect",
    "With Github, you can sell software to ICE! doing war crimes and losing your mask of humanity is never been easier :D",
    "Still not sure what Phil Wang has to do with this",
    "I can guarantee that almost everyone watching this video already knows/uses Github already",
    "Everything of the lies you can actually get for real with GitLab.",
    "Loved the video, animation and overall production. But WHAT IS GITHUBB?",
    "Good ad guys. Never thought github will have to use ads to promote itself.",
    "visually striking, yet i imagine there are tons of people who will see this and still do not understand what the heck github is",
    "wow that was awesome. First part reminded me of thet lego film. + i talk to my cat insteda of a ruber duck :)",
    "Challange: find a white man from video made by a company which is in a country of 79% of White people.",
    "Shout out to Linus Torvalds, the man who create git.",
    "good",
    "Love the rubber duck analogy.",
    "i just looked up what is github all about a few days ago, only to get an answer from github himself lol",
    "Phil by name, Wang by... second name.",
    "i stil dunno get it what gitbub is",
    "It's flexible 💪",
    "\"Lets build from here\". Actually a really good slogan",
    "tg",
    "\"Merge instantly\" yeah about that...",
    "wooo wait is programing cool after this? ",
    "That's all cool, but why is GitHub?",
    "This ad almost made me cry.",
    "ole Philly Philly Wang Wang",
    "dei advertisement. thinking that people working in programming looks like any of these guys lol",
    "Ah yes, existential dread setting in...",
    "1 like for great explanation about GitHub",
    "funky duck",
    "Phil Wang, you dirty little Wang Wang. Love it!!",
    "It's also, arguably, the world's biggest software pirate, depending on what happens with the CoPilot class-action lawsuit.",
    "Thanks a lot.",
    "everybody gangsta till an intern decide to 'git push --force'",
    "Now I have to make a hard decision, learn programming or Github ",
    "weird characters",
    "I still have no real what github is",
    "- What about stackoverflow...\n- Savior of humanity.",
    "I'm so glad that there are so many strong powerful women of color working at github!!!! show elon musk a thing or two about \"burning the midnight oil\". self care first!!!",
    "It's always \"What is GitHub?\" , but never \"How is GitHub?\"",
    "That's the best product description I've even seen.",
    "I really really really love this video",
    "I love Phil Wang",
    "Github: The Multiverse of Duckness",
    "this made me want to program, after being kind of low-spirited to code. And in two minutes I found what i want to work with.. maybe I knew but just didn't have the courage to change paths. thx github :D",
    "I'm 2nd year student of btech and i still doesn't know about this",
    "damnnnnn what an Ad!",
    "Is this the \"hub\" they were talking about?",
    "\"We steal data and train AI models\"",
    "Video is so perfect that I've nearly cried.",
    "they spent their whole marketing budget on an ad that tells you next to nothing",
    "you might wonder what github is. it's qatari. it's gay. it's migrant worker.",
    "amizing",
    "Como fazer tradução do vídeo não entendi nada o que tem que fazer na plataforma",
    "Where does a non coder start here ?",
    "I don't get it...",
    "I want that duck. Where to get it from?",
    "also github is a license ignoring copilot teacher :P",
    "Thanks to its massive improvement these days\nHistory of Version Control System\n\n1986 Concurrent Version Control System (CVS) introduced by Walter Tichy\nThis one has two main drawbacks: No integrity checks to files, keep track of only text files and not binary or video format\n\nSVN Subversion created by CollabNet in 2000  a success to CVS \n\nGit 2007 by Linus Torvalds, was to host linux kernel source code",
    "Worst explanation i have ever seen",
    "It feels like I just watched a movie.",
    "What a great explaination 🎉",
    "Interesting ad",
    "GitHub is Love <3",
    "GitHub is a cat. Noted.",
    "Linux konichiwa git",
    "The world needs my 13 useless archived repos.",
    "Well, if there was ever a way to make an inspiring ad, this is it.",
    "0:35 *microsoft acquired",
    "You can congrats your art director, it’s wonderful",
    "Holy shit, the animation studios that worked on this should be super proud! Not only that but the way they explained branches as alternate timelines allowed something that many take for granted to be seen in a new wondrous light.",
    "teh CGI level is sooo damn good",
    "Ngl this looks like it was a Netflix creation",
    "It's PornHub, but with a lot of Git.",
    "Really? I thought people knew Github.",
    "2:04 Why's the CEO a woman??",
    "its me",
    "github is to git, what pornhub is to porn",
    "Most useless video I've seen. I still have no idea what the h*** github is after watching this.😂",
    "I WANT THAT DUCK",
    "I LOVE THIS💓💓",
    "Phil Wang, Philly Philly Wang Wang, Wangster",
    "I don't know about using GitHub (GitLab/Gitea is better), but I'd buy that rubber duck tho",
    "wow kinda felt like a cyberworld movie intro here. dope.",
    "2:11 *says \"black hole\"\n*shows a black woman",
    "Github is where \"OUR\" code resides.",
    "I absolutely hate GitHub, it’s too vast of a universe to learn to work with and nobody can teach or teaches anyone your just expected to k ow everything about it already…….\nI hate GitHub, I had a dev job and walked out because they wanted me to use Git and GitHub and I can never get it working because I don’t understand it at all even after trying since 2012 I still can’t clone a branch, nor am I confident I am saving stuff properly, it’s so hard and convoluted and nobody for help or support learning",
    "And we all know why we became software developers. For the poontang.",
    "I love mud",
    "I think GitHub is some kind of porn site ..... haha... LoL",
    "will github be paid after that?",
    "I cannot host my website there isnt guide how to install my we",
    "i love this",
    "I like ducks",
    "I really want that duck",
    "Github acting like they invented git. Smh :(",
    "Animator: What style of animation do you want for your presentation?\nGitHub: Yes.",
    "cool",
    "It is always \"What is GitHub?\" and never \"How is GitHub?\"",
    "Why a duck though.",
    "I feel like GitHub's logo should have been a rubber duckie now xD",
    "Just used Github for the first time in my 1st year of uni... it was mysterious and fun to use",
    "Just perfect 👌",
    "i just get my hacks for games from git hub lol 🤣🤣",
    "If this is what the future looks like... then I want to live in it",
    "Terrible video looks nothing what the website i just signed up for 😅😅😅",
    "GitHub is THE way 🚀🚀🚀",
    "So... what is Github exactly?",
    "it's a great video, I really felt that belonging this community",
    "it's a hub for gits.",
    "Someone explain why is he talking to a duck 🦆",
    "Amazing production, but I still don’t get what a Github is 😬",
    "As cool as this video is, so boring us using it haha",
    "But github logo has Cat in it.\nBut Duck in the video is more cute tho.",
    "I did not expect to see Phil Wang in a GitHub ad, but I'm 100% for it",
    "This... this is a spoof, right? Right?",
    "This is how you do pretty advertising\nThis is amazing, don't know how or who worked on this but love it\n\nWould like it  if you bringed back the globe though i found it pretty lovely it's now \"open source\"",
    "Outstanding!",
    "1:33 Blender Guru reference",
    "Don't know why but this gives me goosebumps",
    "This isn't just an ad.. It's an inspiration 🤧❤️",
    "laughs in php getting hacked by a \"typo\" commit",
    "Waste of time, this is like SEO in video form. A bunch of words but no real content.",
    "Yes! The rubber duck! Can you offer that duck as merchandise!",
    "tfw school of motion",
    "Having watched Taskmaster, I laughed so hard at the first second when I saw Phil Wang 😂",
    "\"Open source championing\" *is proprietary*",
    "I NEVER WANTED THIS VIDEO TO END ❤.",
    "SCAM was expecting an alien cat or whatnot... What the hell that duck doing there???\n~JK! Gives me chills actually... But really, can't get the duck out of my mind 😀",
    "he haggled for that role you know. github said 30 bucks he said 15 github said 30 he said 20 github said 30. so... he paid 30 bucks",
    "I am ready to explore.",
    "i just use it to download fonts",
    "So wait ... what's GITHUB ?",
    "What's Phil Wang doing in Github?!?",
    "Video: \"When we are ready to merge, we merge instantly\"\nMerge Conflicts : \"Wait a sec...\"",
    "office 365 clears 🥱",
    "Internet",
    "This is fantastic performance.",
    "hello there GIt comm. i just want to remark that this has became a sybil witch hunt. im new to crypto and social media and thereby seem to be 10yr. behind the crowd. struggling to  keep up with all news / outlets and getting accustomed to socialmedia and all the different UI's has been a daunting task for this old tony.  But to ban me or others in my scenario and accuse me of having a github acc. solely to prey on incentivized projects ,after having stepped into the crypto eco in one of the toughest years and losing my hard earned money tell me how am i somekind of predator that deserves to be banned from getting a chance to participate. not even to mention all the \"vets\" sybil attacking with 10s and 100s of wallets/accs. that get away with it. i have one name ,one acc. on each platform and one wallet. have done nothing wrong and you find some reason to ban me ? i guess i should congratulate you ?",
    "Nice collection of buzzwords and hype, without explaining anything.     🙄",
    "dope",
    "I like how they talk about the features of Git as if they're GitHub features 😂",
    "A very pretty, and pretty confusing ad.",
    "mind-blowing add",
    "I think all of the jargon will make beginners even more confused",
    "Github is a platform where you can publish your opensource coding using git, same as Gitlab or gitea or what every is out there.",
    "“Our code”? You mean “code made by our users & clients”? Or do I need to read thru ToC to see that you’ve now changed it so you now own my code?",
    "I've heard of code smell but now I can say I've watch a software perfume ad.",
    "I am beginner in understanding how to use GitHub, so please let me know if I am on the correct path to creating a multi functional media play for my website. Probably a very simple idea for every one on this platform. As a funeral home owner I want to create a media player to imbed streaming services, but also have call to actions located around the media player. Visitors watching a virtual service, would also have the option to virtually sign an ebook that would later be print in guest book that would be given to family.",
    "GitHub is like PornHub but for software devs",
    "Is a product where to upload your code for free and copilot uses without asking you. \nFunny part is that copilot is not free despite the all free code they took for free without permission to train an IA",
    "What is the difference between GitHub and GitLab?",
    "Ruby ❤",
    "so the silhouette is a duck, not a cat with its tail",
    "Is that Philly Philly Wang Wang?",
    "github is the biggest gayy social network in the world",
    "I really got me crying at \"To build anything you think that the world needs\".",
    "love the rubber ducks and how the guy is explaining it to the duck like the practice of rubber duck debugging",
    "Did I click only for Phil Wang? Yes. Yes, I did.",
    "They should have added a post credit scene of githup copilot as villain",
    "That was one beautiful ad 😂",
    "Animation is insane! Also love the actor (think he’s a comedian)",
    "PHIL WANG!",
    "turn on the caption on 0:42 lol \"our code dead\"",
    "Awesome 🔥🔥",
    "best video about github ever :D",
    "No one asks how is github",
    "Wow, was not expecting to see Phil Wang in this context.",
    "Can you please let me know if we can link the monthly ledger balance from tally to excel.\r\nfor example CGST Input 2.5%, CGST Input 9%, For GST audit purpose.",
    "Cool, but what's GitHub? 🤣",
    "Here come all the tech/CS bandwagons",
    "but what about john finance",
    "This Spider-Man: Across the Spider-Verse trailer was very strange but I liked it",
    "They should play this before movies.",
    "Friendly reminder that git is actually a tool made by linus torvalds that stands completely on its own!\nYou can host your own git repositories or even use alternative cloud services!",
    "This video is a work of art showing what crazy things humans are capable of.",
    "github is where you can submit your code so AI can learn it and steal your job with no kickbacks for you",
    "Where does one purchase that particular style rubber duck?",
    "Diversity! Yeah!\nInclusion! Yeah!\nForced Vaccination! Yeah!",
    "Any one else feeling sick after watching this ? 😐😑",
    "Phil Wang??? That you???",
    "You can fill Microsoft is now its owner. Such a corporate bla bla and the feeling of a bloated, soon-to-fail good idea.",
    "Epic!",
    "And we just merge without conflicts like a bunch of happy ducks!",
    "2:42",
    "How do you use github?",
    "VERY well made intro to this. Love it!",
    "Very fantastically illustrated 💯",
    "If only working in tech was as fun and exciting as this video...",
    "Loved the video 🙌🏻🎉",
    "Love some Wang.",
    "Thanks for enlightenment. I don’t know what GitHub is in my 10 year developer journey 👏🏾👌",
    "Very inspiring!",
    "My reaction and duck reaction were the same while watching this whole video",
    "PHIL WANG!!",
    "Oh Phil! 💯",
    "google drive is the way to go 🤣",
    "I'll tell you who github is... it's like any other large company. Bought out by Microsoft.",
    "They ask what GitHub is and who GitHub is but not how GitHub is 🥲",
    "GitHub is the one and only tool that CHANGED THE WORLD! thank you Chris Wanstrath, P. J. Hyett, Tom Preston-Werner, and Scott Chacon for all your work!",
    "I want the duck toy appears at 0:17",
    "ts probably the tuffest animation ive ever seen",
    "Phil Wang? Interesting choice there.",
    "I'm even more confused about what Github is after watching this video.",
    "I'm not a programmer but still use it to look for some interesting app on it 😂",
    "Mewao",
    "apagnmna",
    "tldr; it's basically git with fancy marketing",
    "Developers are not hackers/phishers 🎉",
    "“When your changes are ready, merge them *instantly*”\n- biggest lie of the whole video",
    "Still I have no duck.\nI should get one.",
    "No discredit to the awesomeness of GitHub. But it was at about 2.10 that I realised this is an ad. What about you.",
    "They are talking like they made git.",
    "It's the Google Drive for codes.",
    "This video is awesome!",
    "My man looks like Mr.Inredible's Boss",
    "Meanwhile, I still have no idea what GitHub is and how people use it even after watching this video 😅",
    "better than meta's metaverse",
    "God damnit microsoft , get out of my things and stop ruining everything i like",
    "Anything 😮",
    "Philly Wang?",
    "Video: Shows Github, Git, branches, coding, fictional universe, duck\nAudience: Doesn't understand difference between GitHub and Git, doesn't understand why it's important, doesn't understand relation to fictional universe, sees duck and gets distracted, something something black hole inclusivity",
    "idk why u asking me",
    "Absolutely beautiful video",
    "finally some love showed for the animators",
    "Which studio made this? Lovely work!",
    "I dont like the stupid duck in the beginning",
    "can you please provide the assets for that duck.",
    "Video is great but a little laggy. However, if you upload it with 50/60 FPS, it will bring more smoothness to the video.",
    "Kudos to the production team, it's a well thought out ad made with an insane amount of production quality!\n\n...and it hits the mark, I will probably send this to folks from other departments when I get the question what Git or Github is.",
    "I literally shed happy tears at the end of this. Open source innovation is the truth!",
    "I think you've mistaked github with git",
    "Me: ** reads out** What is Github\n\n\nMan: What do you mean what is Github",
    "So what fuck are talking about?",
    "I know my question is stupid, but please answer it. Can I restore the archive badge from my previous account to the new account? like GitHub article value",
    "YEah that explanation was a bit too sophisticated.. keep it simple.",
    "I'm not a coder. How did this get on my computer? Does it have something to do with Discord?",
    "github is one of the softwares ever made",
    "피씨에서 아침에계정인증네이버가지고사라진네이버블로거정태암관리자를그런자리에올린 구글고발합니다01062094367  027081007  15773754",
    "поменяйте чувака. бармочит себе там что-то под нос. вы бы еще глухонемого взяли на съемки!",
    "EXPLAINING TO DUCK REFERENCE LMAO",
    "That guy thinks we are the duck 🦆💀",
    "awww, this duck is really cute.",
    "It's a place where you can be fired for complaining about Nazis.",
    "I love Phil Wang!",
    "LOVED IT",
    "YES, this video is very impressive I like it and also very educating!",
    "Man, this kicks butt!",
    "Where is our catopus!!",
    "efguj",
    "Ok guys, going to learn blender",
    "RUBBER DUCKY! Genuinely one of the best debugging/troubleshooting assistants ever",
    "The duck 😂",
    "I came for Github and Phil Wang, I stayed for the animation.\nI miss Phil's yellow onesie tho... Would've gone great with the duckie!",
    "Phil Wang is Best Wang.",
    "It would be nice to reward every year the most utils software teams or technologies like docker",
    "wow video worthy of my comment",
    "I felt like the duck. I already knew but was there listening and watching. and I loved it",
    "This animation really got me😅😅",
    "😮🎉now I know what github is",
    "duck duck go,",
    "simply a platform for download code except useless",
    "The world's largest HOMO sexual gathering place, for male.",
    "Amazing video\nI love GitHub",
    "Damn had to watch this twice😂,am slow af",
    "finally an ad I wouldn't skip",
    "github is a cat",
    "Admittedly I only clicked because of Phil Wang",
    "Once you learn to use it, you can't turn back :p",
    "this is daym sick",
    "I left YouTube on autoplay and this appeared after 36 Vtuber clips",
    "Right now the world need that rubber duckie",
    "It could be better if they mention the creator of git Linus Torvald. \n\nGitHub is a hosting site and Git is the actual technology which is underlying.",
    "That was amazing. Thanks for making engineering cool again",
    "the conclusion gave me goosebumps😅",
    "Ur cloud ☁️ as well as ur physical workplace both r grt",
    "I need an explainer video for this explainer video. Still don't know what's it for.",
    "Мені теж цікаво",
    "This is a video about GitHub but here I'm shouting YES I'm a Programmer I make the rules,",
    "Jesus Christ! I just started learning code and how to use the Linux terminal last week, and this made me cry. This got me so hyped to keep learning!!!",
    "It ain't BitBucket though is it....?",
    "Got goose bumps!",
    "oh gosh, the video quality is awesome",
    "Github's great, but this video feels pointless",
    "Wanted to commit into a relationship \nBut committing into a repository 🥲",
    "this is so cool whoa\n",
    "Dang is everything an algorithim!",
    "I prefer the explanation from the old \"what is github\" video :/\nThis one is just aesthetically better, but it doesn't explain a thing",
    "Don't like githubs dishonest claim on git demonstrated here.",
    "Ideal for all the people that ask why GH instead of Azure DevOps? ;).",
    "we are grateful to linus for his sharing of making linux source codes open. that really open the era of open-source!",
    "Best ad I've ever seen.",
    "What is github?\nA place where Microsoft can yoink the code and train his Ai.",
    "I'll do *you* one better, why is GitHub?",
    "Hi GitHub, fantastic video. It gives me the feeling of Marvel's WHAT IF? and Into the spiderverse animation.\n\n Please who were the animators behind this beautiful video?",
    "Github is the place to go for ready code 😁",
    "who is this for?",
    "Is that philly philly wang wang? xD",
    "Help me please",
    "Black Mirrors, or Love Death + Robots?",
    "so is the actual github source code open source?",
    "Yeah you are inside Microsoft. I don't get paid",
    "Who did this? 😂😂😂\n\nIm really curious who the lead on this video was, and the animators.",
    "My favourite command \"git push --force\"",
    "This is BEAUTIFUL!",
    "Good scotts wow this is wow & in 2022",
    "this is the reason why im irreg student! fuck that!",
    "we use gitlab lol get gut",
    "Is that Phil Wang?",
    "I'm waiting for the duck to quack at the end of the video, disappointed, but the video was well made so I'm no longer disappointed 🐣",
    "you are explaining what is github with a lots of tech jargons ... branch , merge , cicd rtc",
    "apart from the info about the GitHub i loved the editing of the video ....",
    "I had to ask Chat gpt what is Github after this ad, nevermind",
    "That's interesting.",
    "Does GitHub have a GitHub?",
    "If Pixar made a video explaining Github it would be this....",
    "Where can i buy that duck?",
    "I'm only here for Phil Wang :)",
    "Not where I expected to see Phil Wang.",
    "\"... it's a CEO\"... No. No it's not, lol.",
    "I still don't understand what is GitHub",
    "idk man this is just where people publish android source code",
    "Trippy",
    "it's like codeforces?",
    "Why is the ceo always a woman",
    "I was left with more questions than answers",
    "WANGGG",
    "Github is a website",
    "GitHub is a duck",
    "What is Github? For the blind, it is light. For the hungry, it is bread. For the sick, it is the cure. For the sad, it is joy. For the poor, it is the treasure; for the debtor, it is forgiveness",
    "I need some assistance please",
    "where the octocat?",
    "Thats a nice company Ideologie ❤",
    "Ok I’m sold, where can I sign up to be a software engineer cause truly this is the biggest human mega project I’ve encountered 21,000 strangers working together to take a picture of a black hole😮\n\nI feel much of what changes the world in todays world begins on this platform, thank you GitHub may you continue to grow and grow and grow!",
    "GitHub is SOURCE",
    "Aih Keren banget! ❤❤❤",
    "its on the most complex and not user friendly sites I've ever used.",
    "*very happy duck noises*",
    "OGs will remember the tractor ad",
    "so your telling me i cant share my cat photo on github ....useless",
    "Awesome content.",
    "A beautiful, exciting and exciting animation 🤩",
    "this is prob the cleanest vid ive seen",
    "github lore",
    "sério?",
    "nice one, Wang",
    "0:08 Why are we looking at this bird?\n2:35 This goes to show you should first find out what anyone you want to explain something to already knows.",
    "After watching this video I regained the motivation\n\n\n\n\n\nTo learn Blender 👍",
    "It's me, a student",
    "Very nice and clear ever explanation!",
    "This intro video made coding seem like the coolest thing in the world. This animation was spectacular",
    "When I heard about blackhole I started to listen.",
    "but why is Github?",
    "Neden böyle bi reklama ihtiyaç duydunuz ki 🤣",
    "Designer: How many models of people with different races do you want in video?\nGithub: YES.",
    "did they delete the original video?",
    "0:18 in the eyes",
    "แจ่เสยิธความรุ้มันก้อหาความรุ้ที่ดีที่สุดจากสนใจอะไร เท่านั้นเอง",
    "GitHub is the trap that Microsoft if using to secretly and illegally read your code with total disrespect to its license, in order to train its AI to write better code and, eventually, make you redundant. And btw, in your video you are describing Git, not GitHub, a technology created by Linus Torvalds that  you are merely exploiting.",
    "why the duck?",
    "Literally felt goosebumps ❤️",
    "I take it Richard Ayoade was too expensive for the role of \"English Nerd with Glasses\". Phil Wang is much less grating on the ears.",
    "this ad is a W",
    "Still don't know what it fucking is. A social network for developers?",
    "u didn't explain anything",
    "Beautiful. In which program was it done and how many people and time was needed to do it.?",
    "Really Awesome!! But why the Duck?!",
    "Great visuals but the video spectacularly fails to explain what GitHub is. Honestly, I would be more confused after watching this video.",
    "idk???",
    "Genuinely, great work. I've never written a line of code, and now I want to.",
    "I got tears",
    "Brought to you by Microsoft. That Microsoft. They own GitHub now.",
    "its a place where my intro CS class project code gets cloned and turned in unedited by future students",
    "github is definitely one of the companies ever made",
    "Please can you provide me with source code of this video ☺️",
    "Github's logo is a cat, and it's a duck that's being shown in this video🫡",
    "duk",
    "Soooo goood!!!",
    "What is the purpose of this video? I feel like I learned nothing of value, and have come nowhere closer to understanding what github is.",
    "every frame of this video was generated and the code was programmed by github pilot",
    "Loved this trailer, can't wait for the movie to come out in theaters!",
    "I love how they represented it there",
    "cool video, made me FEEL - well done to the content team",
    "Classic Devs making everything complicated. Git Hub social media site for code.",
    "The Wang / Github crossover I wasn't expecting to see in my recommended hahah",
    "Dear GitHub, I am sorry if this comes out as an offensive message to your company, but that is the ugliest duck that I've seen.",
    "So what is github?",
    "Anyone know what brand of glasses he‘s wearing?",
    "GitHub is the second most visited website whose name includes the word 'hub'. \n\n- 🇧🇩",
    "This is how trailers should be made.\n\n\n\n\n Professional Companies learn from this.",
    "wish octocat was his sidekick mascot.",
    "so... the logo is a cat, but the mascot is a duck? ok, anything works. :)",
    "I really do feel like the rubber duck",
    "hello wang, didnt know u are a truly geek",
    "Can anyone explain to me how to get followers in GitHub",
    "Gitgud",
    "YEAH!!! FU@% YEAH!!!",
    "Love this",
    "Great video, but I think it's a terrible answer to what GitHub actually does for you. Any beginner who doesn't know why he/she should use GitHub will not use it after this video...",
    "why phill wang?",
    "This was absolutely incredible.",
    "Amazing !!",
    "it is good",
    "Hi my name is James how is every one doing? Sorry to bother recently I have been hacked by people in your community they have destroyed one of my laptops and the other is now locked. I had a life changing injury while about 1.5 years ago and am in a bad financial position and was already suffering with more pain than many of you may suffer with day to day. For me just waking knowing that I can barely walk how iam I gonna get thru this day when I am in the roofing industry. If you can imagine anything worse.\n\n\n\nAfter I figured out how to find the codes and after both my laptops were made non functional. One is destroyed and the other is locked (any help would be greatly appreciated)\n\nI believe now that I woufd have been able to see the handles/ login names of the persons haking my pc.\n\nAfter they locked my backup laptop last night I received information from the community regarding licensing and or copy write information with regards to the rre authoring/re sale of literature that I have studied and saved to my laptops.\n\nAnd on the cloud.\n\nDoes anyone know if you guy have a policy to hack people who are downloading history information online? Also I only read and study the information and copy things into my notes that I want to say like when ai pray to The Good Lord. Most of what I study is history about God and ancient Egypt etc. I do not re sell any information.\n\nCan you please let me know an email to contact anyone there if what I am describing is not a fair and ethical thing for peiple in your community to do to others people like me?\n\nAlso,\n\nIf anyone knows if I broke any rules or laws regsarding researching history for my own personal study and making personal notes with my studys for prayer reasons can you please let me know that also.\n\nI do not re author or sell resell any information that I have went online to research.\n\nI do download it and copy and past it in my notes on my cell phone under the titles that I can search to find when I want ro pray or say a particular sentence so if anyone knows that is breaking rules laws etc. Can you please let me know that as well?\n\nThat being said do any of you know:\n\nIf this is a normal practice for people In your community to do? I see there are guidelines for bullying and being mean?\n\nI do not understand why people in your community would want to destroy a person's only way to make a living after a severe injury which is helping clients get their properties repaired after fires floods and storms.\n\nIf anyone knows the answers to my questions, or if you can direct me to an email that I could contact someone to discuss this that can explain if I did something wrong or if peiple in your community did something unethical to me and you would like to see that people suffering out in the world do not get picked on by people in your community and or some assistance, my backup laptop could be unlocked still be unhacked they chabged the passcode,\n\nCan you please send me any emails to the people in Git that can assist me?\n\nPlease and thank you.\n\nSincerely,\n\nThe Claim Handler",
    "TVA: I don't like this 🔫",
    "Lmao it feels almost as if you are in a sci fi future year-2120 tech disney movie where this is a company your grandson builds in the future where you somehow got teleported and you are inside their campus with all white big scrapers with this advertisement playing on the screens...and ultimately you find out that your grandson is actually evil ..and all these colours and vibrancy is there to just distract people ....and then you find out your real grandson is actually held hostage by his partner who later enacted as him....then with your 15yo ass, your grandson, and an old lady named tina that appeared out of nowhere in middle of the movie take back control over the company....and with final farewells..you get to know tina is actually your  grandson's ...Grandmother....meaning she'll be your wife...and till you grasp this situation....you are sent back to year 2023...with your holidays over and you finally entering a new grade....and there you see...a gorgeous girl....and while you were adoring her from a distance you get cliché bullied...and then that girl stands up for you and scares em bully away....and extends her hand towards your sorry ass and ...yep you all know it ...says \" Hey, My name is Tina\"...\n\nBamm Movie over!\n\nI am rethinking my idea of being a coder now😂",
    "Phil Wang doing GitHub commercial? Awesome!",
    "Tom Scott vibes",
    "Great overview, thanks.",
    "i remember the time that we used github and we always fuck everyday hehehe",
    "Great Storytelling and awesome animations",
    "Ohh I get it GitHub is an Alein 👽",
    "Great then Copilot enters the chat",
    "what is github? oh that is where I put my cheats for games lol",
    "Is that Phil Wang?😭",
    "Nice definition of GitHub right to a modern generation.",
    "I had no idea what GitHub was before! I have even less of a fucking clue now! Thanks!!!",
    "Another BS woke video. They try to portray that coding is done by women or a women ceo but the reality its made by men and used by men, mostly white and asian men. I have yet to meet  black woman 'coder' 😂",
    "I still didn't understand what git hub is",
    "if only there was a taskmaster reference here ;-;",
    "1:58 future jobless because AI gonna take his job 😢",
    "So, is it like PLM in engineering software? A collaboration platform..? Why is every explanation about this is so bad? It is a brilliant video, sure but I still don't get it. \n(I am not an idiot, I code a little, for mostly hardware, and mathematical models of physics and stuff)",
    "1:11 Some checks haven't  \"cimpleted\" yet at left 🤣",
    "Would buy that rubber duck",
    "awesome",
    "Guy sounds like Tom Scott.",
    "2:30 cat god",
    "I loved this video.",
    "I honestly want 2:21 as a 4K wallpaper",
    "Still don’t get it",
    "Couldn't be more diverse if it tried.",
    "PHILLY PHILLY WANG WANG!!! KOJI",
    "Negotiations for payment…\nPhil: I’ll do the video for 20 million\nGitHub: 2 thousand\nPhil: 1 million\nGitHub: 2 thousand \nPhil: 50 thousand\nGitHub: 2 thousand \nPhil: 2 thousand \nGitHub: yes. \n\nLove the visual style here!",
    "Beautifully made video!",
    "Anything you think the world needs. But not necessarily the world pays for.",
    "Isn't that Phil Wang? 😯",
    "wow",
    "This makes me think less of both Phil and GitHub 🤷‍♂️ this is somehow eerily dreadful. Like when the protagonist visits the girlfriend’s parents right before he realizes what’s happening in “Get Out”. Is Microsoft harvesting our organs? What’s going on?",
    "Hay what is github actually 😕",
    "Thank you github, you help me a lot",
    "They acting as if they invented git instead of github literally just being a hub of git repos",
    "What are the main differences between github and git?",
    "Now I need a github anime",
    "impressive",
    "dude. i love the style of this video so much! its the style that always gives me weird unexplainable lost feeling, idk if its just me that feels this. its just awesome everytime i get this feeling.",
    "Github is a fancy container for your remote git repositories. Git is the star of the show and there are other commercial options apart from GitHub, you can even have your oen server since the heart of everything is git.",
    "ngl this is cool",
    "Gitlab is the best, far better than Github.",
    "Here for Philly Philly Wang Wang",
    "WOW! That was an impressing presentation!!!",
    "Wow, thank you for this. I was wondering the same thing.",
    "meh, github is just the \"host\" for all these activities, nothing more. all these are the features of the open source software git.",
    "Where is the octocat?",
    "What a lovely inspiring video, thank you for this to everyone! <3",
    "bitbucket is better",
    "Where can I find a duck exactly like that one?",
    "The line at 0:42 \"We even went to mars, or at least *OUR* code did\" really speaks volumes as to who actually owns \"your\" code",
    "Actually Im not at all more knowledgeable about how it works in practice",
    "Rubber duck rubber duck rubber duck, theeeen octo cat. Hmmm... 🤔",
    "Master piece. I would wanna work for the company that created this video.",
    "duck.",
    "I love github so much",
    "Moved everything to Bitbucket the day MS bought Github and I have yet to regret that decision even for a second.",
    "What do you mean by \"What is GitHub\"? \nIt's the world's biggest developer platform, secured, and business-astonishing.",
    "Thank you github for making every fucking dev job about spouting useless commit numbers and redundant LOC for the sake of evaluation. Very cool 👍👍👍",
    "Cool",
    "This is an amazing trailer. It really makes me wanna use GitHub even though I am already doing so",
    "It should be the Octopus as mascot not the rubber duck",
    "so, what is github?",
    "Music too loud.",
    "GitHub is awesome!",
    "plz unban my account",
    "Very much excited for it!!!!",
    "Most stupid explanation ever!!",
    "Fucking LGBT here already",
    "*goosebumps* 😀",
    "GitHub is a library of  endless coding and programming solutions"
]